The following piece of code is for connecting with sqlite3. For executing any query you just need to write the query and run the command execute_query(query)

In [1]:
import sqlite3
import pandas as pd
from sqlite3 import Error

 
def create_connection(db_file):
    """ create a database connection to the SQLite database
        specified by the db_file
    :param db_file: database file
    :return: Connection object or None
    """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        #print(sqlite3.version)
    except Error as e:
        print(e)
 
    return conn

 
def select_all_tasks(conn, query1):
    """
    Query all rows in the tasks table
    :param conn: the Connection object
    :return:
    """
    #cur = conn.cursor()
    #cur.execute(query1)
    df = pd.read_sql_query(query1, conn)
    print(df)
    #for row in rows:
     #   print(row)


def execute_query(q):
    database = "sqlite_db_pythonsqlite.db"     
    # create a database connection
    conn = create_connection(database)
    with conn: 
        #print("2. Query all tasks")
        select_all_tasks(conn, q)

Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name 
and total revenue, sorted by revenue. Remember that there's a different cost for guests and members!

In [2]:
query10 = """
WITH cte AS (SELECT name, SUM(cost) as revenue FROM (SELECT f.name, CASE
    WHEN m.memid = 0 THEN b.slots * f.guestcost
    ELSE b.slots * f.membercost END AS cost 
FROM Bookings AS b
LEFT JOIN Facilities AS f
    USING(facid)
LEFT JOIN Members AS m
    ON b.memid = m.memid
GROUP BY b.bookid) AS sub
GROUP BY name)
SELECT *
FROM cte
WHERE revenue < 1000;
"""
execute_query(query10)

            name  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

Q11: Produce a report of members and who recommended them in alphabetic surname,firstname order

In [3]:
query11 = """
SELECT DISTINCT m1.surname|| ', '|| m1.firstname AS member_name, 
m2.surname || ', ' || m2.firstname AS recommended_by
FROM Members AS m1
INNER JOIN Members AS m2
ON m1.recommendedby=m2.memid
WHERE m1.recommendedby !=0
ORDER BY member_name;
"""
execute_query(query11)

                 member_name      recommended_by
0            Bader, Florence    Stibbons, Ponder
1                Baker, Anne    Stibbons, Ponder
2             Baker, Timothy     Farrell, Jemima
3                Boothe, Tim         Rownam, Tim
4            Butters, Gerald       Smith, Darren
5               Coplin, Joan      Baker, Timothy
6             Crumpet, Erica        Smith, Tracy
7                Dare, Nancy    Joplette, Janice
8           Genting, Matthew     Butters, Gerald
9                 Hunt, John  Purview, Millicent
10              Jones, David    Joplette, Janice
11            Jones, Douglas        Jones, David
12          Joplette, Janice       Smith, Darren
13           Mackenzie, Anna       Smith, Darren
14             Owen, Charles       Smith, Darren
15             Pinker, David     Farrell, Jemima
16        Purview, Millicent        Smith, Tracy
17         Rumney, Henrietta    Genting, Matthew
18         Sarwin, Ramnaresh     Bader, Florence
19               Smith, Jack       Smith, Darren
20          Stibbons, Ponder       Tracy, Burton
21  Worthington-Smyth, Henry        Smith, Tracy

Q12: Find the facilities with their usage by member, but not guests

In [4]:
query12 = """
SELECT f.name, SUM(b.slots) AS total_usage
FROM Facilities As f
INNER JOIN Bookings AS b
USING (facid)
WHERE b.memid !=0
GROUP BY f.name;
"""
execute_query(query12)

              name  total_usage
0  Badminton Court         1086
1   Massage Room 1          884
2   Massage Room 2           54
3       Pool Table          856
4    Snooker Table          860
5     Squash Court          418
6     Table Tennis          794
7   Tennis Court 1          957
8   Tennis Court 2          882

Q13: Find the facilities usage by month, but not guests

In [5]:
query13 = """
SELECT f.name, strftime('%m',b.starttime) AS month,
SUM(b.slots) AS total_usage
FROM Facilities As f
INNER JOIN Bookings AS b
USING (facid)
WHERE b.memid !=0
GROUP BY f.name, month;
"""
execute_query(query13)

               name month  total_usage
0   Badminton Court    07          165
1   Badminton Court    08          414
2   Badminton Court    09          507
3    Massage Room 1    07          166
4    Massage Room 1    08          316
5    Massage Room 1    09          402
6    Massage Room 2    07            8
7    Massage Room 2    08           18
8    Massage Room 2    09           28
9        Pool Table    07          110
10       Pool Table    08          303
11       Pool Table    09          443
12    Snooker Table    07          140
13    Snooker Table    08          316
14    Snooker Table    09          404
15     Squash Court    07           50
16     Squash Court    08          184
17     Squash Court    09          184
18     Table Tennis    07           98
19     Table Tennis    08          296
20     Table Tennis    09          400
21   Tennis Court 1    07          201
22   Tennis Court 1    08          339
23   Tennis Court 1    09          417
24   Tennis Court 2    07          123
25   Tennis Court 2    08          345
26   Tennis Court 2    09          414